In [1]:
import pandas as pd

In [54]:
df = pd.read_csv('UserData.csv')

In [3]:
df

,Unnamed: 0,username,password,name,address,phonenumber,preference,token,expiry
0,0,ralph_ray,MyPassword123!,RalpH Ray,"10, Downing Street, LA 3ED 5B7",(1022) 233-9202,HomeElectricals,NaN,NaN
1,1,s_jones,Smith999!@,Smit Jones,"22 Ivory Island, New York, WE9 87G",(1121) 335-6784,Lights,NaN,NaN
2,2,roverd,April23!,David Rover,98 Manning Town Events Day TowerNew Jersey 23E...,(2344) 749-5671,Logistics,NaN,NaN

In [4]:
df[(df['username'] == 'roverd') & (df['password'] == 'April23!')]

,Unnamed: 0,username,password,name,address,phonenumber,preference,token,expiry
2,2,roverd,April23!,David Rover,98 Manning Town Events Day TowerNew Jersey 23E...,(2344) 749-5671,Logistics,NaN,NaN

In [12]:
df[(df['username'] == 'ralph_ray') & (df['password'] == 'MyPassword123!')]

,Unnamed: 0,username,password,name,address,phonenumber,preference,token,expiry
0,0,ralph_ray,MyPassword123!,RalpH Ray,"10, Downing Street, LA 3ED 5B7",(1022) 233-9202,HomeElectricals,NaN,NaN

In [42]:
obj = df[(df['username'] == 'ralph_ray') & (df['password'] == 'MyPassword123!')]

In [43]:
obj.at[0, 'token'] = '123'

In [47]:
df

,Unnamed: 0,username,password,name,address,phonenumber,preference,token,expiry
0,0,ralph_ray,MyPassword123!,RalpH Ray,"10, Downing Street, LA 3ED 5B7",(1022) 233-9202,HomeElectricals,NaN,NaN
1,1,s_jones,Smith999!@,Smit Jones,"22 Ivory Island, New York, WE9 87G",(1121) 335-6784,Lights,NaN,NaN
2,2,roverd,April23!,David Rover,98 Manning Town Events Day TowerNew Jersey 23E...,(2344) 749-5671,Logistics,NaN,NaN

In [48]:
df.loc[df.username == 'ralph_ray', 'token'] = '123'

In [56]:
df['token']

0                                                  NaN
1    b'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHA...
2                                                  NaN
Name: token, dtype: object

In [57]:
from datetime import datetime

In [59]:
df['expiry']

0                           NaN
1    2018-12-16 14:18:48.956859
2                           NaN
Name: expiry, dtype: object

In [61]:
df['expiry'] = pd.to_datetime(df['expiry'])

In [63]:
df[df['expiry'] < datetime.now()].empty

False

In [69]:
obj = df[df['username'] == 'roverd']

In [79]:
df[(df['token'] == '1223') & (df['expiry'] == datetime.now())]

Empty DataFrame
Columns: [Unnamed: 0, username, password, name, address, phonenumber, preference, token, expiry]
Index: []

In [75]:
df

,Unnamed: 0,username,password,name,address,phonenumber,preference,token,expiry
0,0,ralph_ray,MyPassword123!,RalpH Ray,"10, Downing Street, LA 3ED 5B7",(1022) 233-9202,HomeElectricals,NaN,NaT
1,1,s_jones,Smith999!@,Smit Jones,"22 Ivory Island, New York, WE9 87G",(1121) 335-6784,Lights,b'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHA...,2018-12-16 14:18:48.956859
2,2,roverd,April23!,David Rover,98 Manning Town Events Day TowerNew Jersey 23E...,(2344) 749-5671,Logistics,NaN,NaT

In [89]:
token = b'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHAiOjE1NDQ5NTUyMDksImlhdCI6MTU0NDk1NDkwOSwic3ViIjoic19qb25lcyJ9.vIfcBGddMlF0NWuvxvBw-JJfmpARBDk7mC0vuI6r_zc'

In [90]:
user = pd.read_csv('UserData.csv')
user = user.loc[:, ~user.columns.str.contains('^Unnamed')]
user[(user['token'] == str(token))]

,username,password,name,address,phonenumber,preference,token,expiry
1,s_jones,Smith999!@,Smit Jones,"22 Ivory Island, New York, WE9 87G",(1121) 335-6784,Lights,b'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHA...,2018-16-12 16:08

In [93]:
user = user[(user['token'] == str(token))]

In [94]:
cart = pd.read_csv('CartData.csv')
cart = cart.loc[:, ~cart.columns.str.contains('^Unnamed')]
usercart = pd.merge(cart, user, on='username', how='inner')

In [95]:
usercart

,cartid,username,productid,orderquantity,password,name,address,phonenumber,preference,token,expiry
0,2,s_jones,103,3,Smith999!@,Smit Jones,"22 Ivory Island, New York, WE9 87G",(1121) 335-6784,Lights,b'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHA...,2018-16-12 16:08

   cartid   username  productid  orderquantity
0       1  ralph_ray        101              2
1       1  ralph_ray        102              5
2       2    s_jones        103              3